---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceTotalEdgeLength
source: html/bcf044b7-38e8-170c-4be0-5b30edf7ce2d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceTotalEdgeLength Property

"Total edge length"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceTotalEdgeLength { get; }
```